sn-induction_3D/openfoam_template_transient/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 506;

boundaryField
{
    freeSurf
    {
        type            fixedValue;
        value           uniform 500;
    }

    crucibleSide
    {
        type            fixedValue;
        value           uniform 500;
    }

    crucibleBot
    {
        type            fixedValue;
        value           uniform 500;
    }

    crysInter
    {
        type            fixedValue;
        value           uniform 500;
    }
    axis
    {
        type            empty;
    }

    defaultFaces
    {
        type            empty;
    }

    "(front|back)"
    {
        type            wedge;
    }
}


// ************************************************************************* //
