sn-induction_3D/openfoam_template_transient/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    freeSurf
    {
        type            calculated;
        value           $internalField;
    }

    crucibleSide
    {
        type            calculated;
        value           $internalField;
    }

    crucibleBot
    {
        type            calculated;
        value           $internalField;
    }    

    crysInter
    {
        type            calculated;
        value           $internalField;
    }

    axis
    {
        type            empty;
    }

    defaultFaces
    {
        type            empty;
    }
    "(front|back)"
    {
        type            wedge;
    }
}

// ************************************************************************* //
